Repository: Schlue/wicked
Catalog: po/*.po
Languages: fi_fi

source: %s does not exist. Create it?
fi_fi: %s ei ole olemassa. Luodaanko se?

source: -d, --debug Run in debug mode (displays extra information)
fi_fi: -d, --debug Aja debug-tilassa (Tulostaa enemm‰n lis‰tietoja)

source: -g, --get[=pagetitle] Return all pages (unless pagetitle specified)
fi_fi: -g, --get[=sivunotsikko] Palauttaa kaikki sivut (ellei sivun otsikko ole m‰‰ritelty)

source: -h, --help Show this help
fi_fi: -h, --help N‰yt‰ t‰m‰ ohje

source: -l, --list-pages List pages
fi_fi: -l, --list-pages Listaa sivut

source: -o, --out[=type] Output type for results (default:xml)
fi_fi: -o, --out[=type] Tulostetyyppi tuloksille (oletus:xml)

source: -p, --password[=password] Horde login password
fi_fi: -p, --password[=salasana] Horden salasana

source: -u, --username[=username] Horde login username
fi_fi: -u, --username[=username] Horden tunnus

source: Add the text from this page
fi_fi: Lis‰‰ teksti‰ t‰lle sivulle

source: AddPage: %s
fi_fi: Lis‰‰ sivu: %s

source: AllPages
fi_fi: Kaikki sivut

source: Are you sure you want to delete this page? All versions will be lost.
fi_fi: Oletko aivan varma ett‰ haluat poistaa t‰m‰n sivun? Kaikki versiot poistetaan.

source: Are you sure you want to delete version %s of this page?
fi_fi: Oletko varma ett‰ haluat poistaa version %s t‰st‰ sivusta?

source: Are you sure you want to restore version %s of this page?
fi_fi: Oletko varma ett‰ haluat palauttaa version %s t‰st‰ sivusta?

source: Attach File
fi_fi: Liit‰ tiedosto

source: Attach a New File
fi_fi: Liit‰ uusi tiedosto

source: AttachedFiles
fi_fi: Liitetyt tiedostot

source: AttachedFiles: %s
fi_fi: Liitetyt tiedostot: %s

source: Attachment Name
fi_fi: Liitteen nimi

source: Author
fi_fi: Tekij‰

source: Back to
fi_fi: Palaa

source: BackLinks
fi_fi: Paluulinkit

source: Can't read uploaded file.
fi_fi: Ei voi lukea ladattua tiedostoa.

source: Can't retrieve "%s": %s
fi_fi: Hakeminen ep‰onnistui: "%s": %s

source: Can't update "%s": no such attachment.
fi_fi: Ei voi p‰ivitt‰‰ "%s": ei sellaista liitett‰.

source: Cancel
fi_fi: Peru

source: Cannot find "%s": %s.
fi_fi: Ei lˆydy "%s": %s.

source: Change Log
fi_fi: Muutosloki

source: Change log
fi_fi: Muutosloki

source: Change log entry
fi_fi: Muuta lokimerkint‰‰

source: Change menu preferences.
fi_fi: Muuta valikon asetuksia.

source: Change references to this page from:
fi_fi: Muuta viitteit‰ t‰lle sivulle l‰hteest‰:

source: Changed references from %s to %s
fi_fi: Muuta viitteet %s:st‰ %s:‰‰n

source: Couldn't read command-line options.
fi_fi: Komentoriviparametreja ei voitu lukea.

source: Create
fi_fi: Luo

source: Created
fi_fi: Luotu

source: Created "%s". Edit this page to set up initial content.
fi_fi: Luotiin "%s". Muokkaa t‰t‰ sivua alustaaksesi sivun sis‰llˆn.

source: Creation Date
fi_fi: Luontip‰iv‰m‰‰r‰

source: Date
fi_fi: P‰iv‰ys

source: Delete
fi_fi: Poista

source: Delete %s
fi_fi: Poista %s

source: Delete Version
fi_fi: Poista versio

source: Delete Version %s
fi_fi: Poista versio %s

source: Deleted "%s".
fi_fi: Poistettiin "%s".

source: Diff From
fi_fi: Eroavaisuudet l‰hteeseen

source: Diff To
fi_fi: Erovaisuudet kohteeseen

source: Diff for %s between %s and %s
fi_fi: Eroavaisuudet %s v‰lill‰ %s ja %s

source: Display %s
fi_fi: N‰yt‰ %s

source: Display Options
fi_fi: N‰kym‰n asetukset

source: Display Version %s
fi_fi: N‰yt‰ versio %s

source: Downloads
fi_fi: Tallennukset

source: Edit %s
fi_fi: Muokkaa %s

source: Edit Version
fi_fi: Muokkaa versiota

source: Edit Version %s
fi_fi: Muokkaa versiota %s

source: EditPage
fi_fi: Muokkaa sivua

source: Enter a name for this file (if blank, will use the file's current name)
fi_fi: Anna nimi t‰lle tiedostolle (Jos tyhj‰, niin k‰ytet‰‰n tiedoston nykyist‰ nime‰)

source: Error creating "%s": %s.
fi_fi: Virhe luotaessa "%s": %s.

source: Error creating new page: %s
fi_fi: Virhe luotaessa sivua: %s

source: Error deleting %s: %s
fi_fi: Virhe poistettaessa %s: %s

source: Error loading page template: %s
fi_fi: Virhe ladattaessa sivumallia: %s

source: Error parsing MIME message: %s
fi_fi: Virhe tulkittaessa MIME-viesti‰: %s

source: Error renaming %s: %s
fi_fi: Virhe nimett‰ess‰ uudelleen %s: %s

source: Error retrieving %s: %s
fi_fi: Virhe haettaessa %s: %s

source: Error retrieving attachments: %s
fi_fi: Virhe haettaessa liitteit‰: %s

source: Error retrieving like pages: %s
fi_fi: Virhe haettaessa samankaltaisia sivuja: %s

source: Error updating %s: %s
fi_fi: Virhe p‰ivitt‰ess‰ %s: %s

source: Failed to retrieve '%s': %s
fi_fi: Hakeminen ep‰onnistui: '%s': %s

source: Go
fi_fi: Mene

source: Guest
fi_fi: Vieras

source: History
fi_fi: Historia

source: History of %s
fi_fi: %s:n Historia

source: If a page with the new name already exists, then
fi_fi: Jos sivu uudella nimell‰ on jo olemassa, niin

source: Info about %s
fi_fi: Infoa %s:st‰

source: Internal error viewing requested page
fi_fi: Sis‰inen virhe n‰ytett‰ess‰ pyydetty‰ sivua

source: Internal error viewing requested page: %s
fi_fi: Sis‰inen virhe n‰ytett‰ess‰ pyydetty‰ sivua: %s

source: Is this a minor update?
fi_fi: Onko t‰m‰ pieni p‰ivitys?

source: Last Modified %s by %s
fi_fi: Viimeksi muokannut %s, %s

source: LeastPopular
fi_fi: V‰hiten suosittu

source: LikePages
fi_fi: Samankaltaisia sivuja

source: LikePages: %s
fi_fi: Samankaltaisia sivuja: %s

source: Lock
fi_fi: Lukitse

source: Lock %s
fi_fi: Lukitse %s

source: Locked
fi_fi: Lukittu

source: Logged in successfully as '%s'.
fi_fi: Kirjauduttiin sis‰‰n k‰ytt‰j‰n‰ '%s'.

source: Login is incorrect.
fi_fi: Sis‰‰nkirjautuminen ep‰onnistui.

source: Mandatory arguments to long options are mandatory for short options too.
fi_fi: Pakolliset optiot pitkille parametreille ovat pakollisia myˆs lyhyille parametreille.

source: Menu Preferences
fi_fi: Valikon asetukset

source: MergeOrRename
fi_fi: Yhdist‰ tai nimea uudelleen

source: MergeOrRename: %s
fi_fi: Yhdist‰ tai nimea uudelleen: %s

source: Merged from %s
fi_fi: Yhdistetty %s:st‰

source: Minor Change
fi_fi: Pieni muutos

source: MostPopular
fi_fi: Suosituin

source: Name of wiki page to display
fi_fi: N‰ytett‰v‰n wiki-sivun nimi

source: Never
fi_fi: Ei koskaan

source: New name
fi_fi: Uusi nimi

source: New name is the same as old name.
fi_fi: Uusi nimi on sama kuin vanha nimi

source: No changes made
fi_fi: Ei tehty muutoksia

source: No such attachment '%s'.
fi_fi: Ei sellaista liitett‰ kuin '%s'.

source: Not implemented.
fi_fi: Ei ole toteutettu.

source: Page
fi_fi: Sivu

source: Page '%s' already exists.
fi_fi: Sivu '%s' on jo olemassa.

source: Page Saved
fi_fi: Sivu talletettu

source: Page Views
fi_fi: Sivun katsomiskertoja

source: Page failed to lock: %s
fi_fi: Sivua ei voitu lukita: %s

source: Page failed to unlock: %s
fi_fi: Sivun lukitusta ei voitu poistaa: %s

source: Page locked
fi_fi: Sivu lukittu

source: Page unlocked
fi_fi: Sivu lukitus poistettu

source: PageSearch
fi_fi: Haku sivuista

source: Pages
fi_fi: Sivut

source: Permissions
fi_fi: Oikeudet

source: Preview
fi_fi: Esikatselu

source: RecentChanges
fi_fi: Viimeisimm‰t muutokset

source: Reload %s
fi_fi: Lataa uudestaan %s

source: Reload History
fi_fi: Lataa historia uudestaan

source: Reload Page
fi_fi: Lataa sivu uudestaan

source: Renamed page from %s
fi_fi: Nimettiin sivu %s uudestaan

source: Restore Version
fi_fi: Palauta versio

source: Restore Version %s
fi_fi: Palauta versio %s

source: Robots are not allowed to create pages.
fi_fi: Robotit eiv‰t voi luoda sivuja.

source: Save
fi_fi: Talleta

source: Save Failed: %s
fi_fi: Tallennus ep‰onnistui: %s

source: Search
fi_fi: Haku

source: Select file to attach:
fi_fi: Valitse liitett‰v‰ tiedosto:

source: Select the file to update
fi_fi: Valitse tiedosto p‰ivitett‰v‰ksi

source: Set permissions for %s
fi_fi: Aseta oikeudet %s:lle

source: Show changes for %s
fi_fi: Talleta muutokset %s:lle

source: Show version %s
fi_fi: N‰yt‰ versio %s

source: Stop and don't do anything
fi_fi: Stop ja ‰l‰ tee mit‰‰n

source: Submit
fi_fi: L‰het‰

source: There is already an attachment named "%s".
fi_fi: On jo olemassa liite nimelt‰‰n "%s".

source: This is a required field.
fi_fi: T‰m‰ on pakollinen kentt‰

source: This page cannot be deleted
fi_fi: T‰t‰ sivua ei voi poistaa

source: This page does not have a history
fi_fi: T‰ll‰ sivulla ei ole historiaa

source: This page is referenced from %d other page(s).
fi_fi: T‰lle sivulle on viittauksia %d sivulta.

source: TitleSearch
fi_fi: Hae otsikoista

source: Type of search for the quick search box:
fi_fi: Haun tyyppi pikahakuun:

source: Unlock
fi_fi: Poista lukitus

source: Unlock %s
fi_fi: Poista lukitus %s

source: Unsupported
fi_fi: Ei tuettu

source: Update File
fi_fi: P‰ivit‰ tiedosto

source: Update an Attachment
fi_fi: P‰ivit‰ liite

source: Usage: %s [OPTIONS]...
fi_fi: K‰yttˆ: %s [PARAMETRIT]...

source: Use this template (templates are pages which begin or end with "Template"):
fi_fi: K‰yt‰ t‰t‰ mallia (mallit ovat sivuja, jotka loppuvat tai alkavat sanalla "Template"):

source: Version
fi_fi: Versio

source: Wiki page
fi_fi: Wiki-sivu

source: You are not allowed to edit this page
fi_fi: Sinulla ei ole oikeuksia muokata t‰t‰ sivua

source: You are not allowed to lock this page
fi_fi: Sinulla ei ole oikeuksia lukita t‰t‰ sivua

source: You are not allowed to unlock this page
fi_fi: Sinulla ei ole oikeuksia poista lukitusta t‰lt‰ sivulta

source: You don't have permission to edit '%s'.
fi_fi: Sinulla ei ole oikeuksia muokata '%s'.

source: You don't have permission to view this page.
fi_fi: Sinulla ei ole oikeuksia n‰hd‰ t‰t‰ sivua.

source: You must enter a change description to save the page.
fi_fi: Sinun pit‰‰ muuttaa kuvausta tallettaaksesi sivun.

source: page '%s' doesn't exist.
fi_fi: sivua '%s' ei ole olemassa.
